app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all
---
SELECT `doctors`.* FROM `doctors`

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO `doctors` (`first_name`, `last_name`, `age`, `email`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Conor"], ["last_name", "Thompson"], ["age", 31], ["email", "dude@dide.com"], ["created_at", "2017-03-06 18:30:36"], ["updated_at", "2017-03-06 18:30:36"]]

    def set_doctor
      @doctor = Doctor.find(params[:id])
---
SELECT  `doctors`.* FROM `doctors` WHERE `doctors`.`id` = ? LIMIT 1  [["id", 1]]