app/controllers/entries_controller.rb

  def index
    @entries = Entry.all
---
SELECT `entries`.* FROM `entries`

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO `entries` (`name`, `diagnosis`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["name", "Dude"], ["diagnosis", "dude"], ["created_at", "2017-03-06 17:56:26"], ["updated_at", "2017-03-06 17:56:26"]]

  def update
    respond_to do |format|
      if @entry.update(entry_params)
---
UPDATE `entries` SET `name` = ?, `updated_at` = ? WHERE `entries`.`id` = ?  [["name", "My"], ["updated_at", "2017-03-06 17:56:40"], ["id", 1]]

    def set_entry
      @entry = Entry.find(params[:id])
---
SELECT  `entries`.* FROM `entries` WHERE `entries`.`id` = ? LIMIT 1  [["id", 1]]