app/controllers/patients_controller.rb

SELECT `patients`.* FROM `patients`
---
  def index
    @patients = Patient.all

INSERT INTO `patients` (`name`, `age`, `diagnosis`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["name", "ciaran Strutt"], ["age", 23], ["diagnosis", "born and raised nigger"], ["created_at", "2017-03-06 18:23:45"], ["updated_at", "2017-03-06 18:23:45"]]
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save

SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = ? LIMIT 1  [["id", 1]]
---
    def set_patient
      @patient = Patient.find(params[:id])